app/views/tweets/index.html.erb

SELECT "tweets".* FROM "tweets"
---
    <% unless tweets.blank? %>
      <%= link_to "#{tweets.count}件", list_tweets_path(:tweets => tweets)  %>