app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def index
    @tweets = Tweet.page(params[:page]).per(50)

INSERT INTO "tweets" ("title", "content", "created_at", "updated_at", "start_time") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["content", "aaa"], ["created_at", "2021-10-26 01:07:51.645762"], ["updated_at", "2021-10-26 01:07:51.645762"], ["start_time", "2021-10-26 01:07:00"]]
---
  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" IN (?, ?)  [["id", 2], ["id", 3]]
---
    def set_tweet
      @tweet = Tweet.find(params[:id])