app/models/tweet.rb

  def self.tweet_count(date)
    self.where(start_time: date)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."start_time" = ?  [["start_time", "2021-09-27"]]